Repository: Suiram1701/WebSchoolPlanner
Catalog: Localization/Views/Privacy/CookiePolicy.*.resx
Languages: de, es

# Title
source: Cookie Policy
de: Cookie-Richtlinie
es: Política de cookies

# MainTitle
source: Our Cookie Policy
de: Unsere Cookie-Richtlinie
es: Nuestra Política de Cookies

# Description
source: Our website uses cookies to give you the best possible online experience.
de: Unsere Website verwendet Cookies, um Ihnen das bestmögliche Online-Erlebnis zu bieten. Cookies sind kleine Textdateien, die auf Ihrem Gerät gespeichert werden. Sie helfen uns, die Website-Leistung zu verbessern.
es: Nuestro sitio web utiliza cookies para brindarle la mejor experiencia en línea posible.

# KindOfCookies
source: Types of cookies we use:
de: Arten von Cookies, die wir verwenden:
es: Tipos de cookies que utilizamos:

# NeededCookies
source: These cookies are essential for the website to function properly.
de: Diese Cookies sind unerlässlich, damit die Website ordnungsgemäß funktioniert. Sie ermöglichen die Navigation auf der Seite und den Zugriff auf gesicherte Bereiche.
es: Estas cookies son esenciales para que el sitio web funcione correctamente.

# FunctionalCookies
source: These cookies store settings and preferences to improve your user experience.
de: Diese Cookies speichern Einstellungen und Präferenzen, um Ihr Benutzererlebnis zu verbessern.
es: Estas cookies almacenan configuraciones y preferencias para mejorar su experiencia de usuario.

# NeededCookiesTitle
source: Necessary cookies:
de: Notwendige Cookies:
es: Cookies necesarias:

# FunctionalCookiesTitle
source: Functionality cookies:
de: Funktionalitäts-Cookies:
es: Cookies de funcionalidad:

# CookieManageTitle
source: Cookie management:
de: Cookie-Verwaltung:
es: Gestión de cookies:

# CookieManage
source: You can control the use of cookies in your browser settings.
de: Sie können die Verwendung von Cookies in Ihren Browsereinstellungen kontrollieren. Beachten Sie jedoch, dass das Deaktivieren von Cookies die Funktionalität der Website beeinträchtigen kann. Mit der Nutzung unserer Website erklären Sie sich mit der Verwendung von Cookies gemäß unserer Cookie-Richtlinie einverstanden. Für weitere Informationen lesen Sie unsere vollständige Datenschutzerklärung.
es: Puede controlar el uso de cookies en la configuración de su navegador.

# CookieChangeTitle
source: Changes to our cookie policy:
de: Änderungen an unserer Cookie-Richtlinie:
es: Cambios en nuestra política de cookies:

# CookieChange
source: We reserve the right to update our cookie policy.
de: Wir behalten uns das Recht vor, unsere Cookie-Richtlinie zu aktualisieren. Überprüfen Sie regelmäßig diese Seite auf Aktualisierungen.
es: Nos reservamos el derecho de actualizar nuestra política de cookies.

# .AspNetCore.Identity.Application.Description
source: This is a token to identify you as a logged in user.
de: Ein Cookie, das die Sitzung des angemeldeten Benutzers speichert, sodass der Benutzer während seiner Sitzung angemeldet bleibt und personalisierte Funktionen nutzen kann. Sie werden gelöscht, wenn der Browser geschlossen wird.
es: Una cookie que almacena la sesión del usuario que ha iniciado sesión para que el usuario permanezca conectado durante su sesión y pueda utilizar funciones personalizadas. Se eliminan cuando se cierra el navegador.

# .AspNetCore.CSRF.TOKEN.Description
source: This is a token to protect against CSRF/XSRF (Cross-Site Request Forgery) attacks to verify that you have submitted the form.
de: Ein CSRF-Token-Cookie schützt vor Cross-Site Request Forgery (CSRF/XSRF), indem es ein eindeutiges Token auf dem Gerät des Benutzers speichert. Dieses Token wird bei Anfragen verwendet, um sicherzustellen, dass sie nur von derselben Website stammen und nicht von böswilligen Dritten manipuliert wurden.
es: Una cookie de token CSRF protege contra la falsificación de solicitudes entre sitios (CSRF/XSRF) al almacenar un token único en el dispositivo del usuario. Este token se utiliza en solicitudes para garantizar que solo provengan del mismo sitio web y no hayan sido manipuladas por terceros malintencionados.

# .AspNetCore.acceptCookiePolicy.Description
source: This cookie remembers whether you have already clicked "I understand" in the cookie policy pop-up so that we do not have to bother you about it in the future.
de: Ein Cookie, das speichert, ob die Cookie-Richtlinie akzeptiert wurde, ermöglicht es, sich an die Einwilligung des Benutzers zu erinnern und die entsprechende Benachrichtigung bei späteren Besuchen zu vermeiden.
es: Una cookie que almacena si se ha aceptado la política de cookies permite recordar el consentimiento del usuario y evitar la correspondiente notificación en visitas posteriores.

# .AspNetCore.Culture.Description
source: This cookie stores your preference as to the language in which we should display our website to you.
de: Ein Cookie, das die ausgewählte Anzeigesprache eines anonymen Benutzers speichert, um eine konsistente Sprachanzeige während der Nutzung sicherzustellen.
es: Una cookie que almacena el idioma de visualización seleccionado por un usuario anónimo para garantizar una visualización coherente del idioma durante el uso.

# .AspNetCore.Theme.Description
source: This cookie stores the color theme you prefer.
de: Ein Cookie, das vorübergehend das Farbthema eines anonymen Benutzers speichert, um ein einheitliches visuelles Erlebnis während der Sitzung zu gewährleisten.
es: Una cookie que almacena temporalmente el tema de color de un usuario anónimo para garantizar una experiencia visual consistente durante toda la sesión.
